Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_DebugConsoleToggleSwitch.AutomationProperties.HelpText
source: Boolean to turn on an output console window that shows the contents of diagnostic messages upon start of a WSL 2 distro instance.
cs_cz: Logická hodnota pro zapnutí okna výstupní konzoly, které zobrazuje obsah diagnostických zpráv při spuštění instance distribuce WSL 2
da_dk: Boolesk værdi til at aktivere et outputkonsolvindue, der viser indholdet af diagnosticeringsmeddelelser ved start af en WSL 2-distroforekomst.
de_de: Boolescher Wert zum Aktivieren eines Ausgabekonsolenfensters, das den Inhalt von Diagnosemeldungen beim Start einer WSL 2-Distributionsinstanz anzeigt.
el_gr: Τιμή boolean για την ενεργοποίηση ενός παραθύρου κονσόλας εξόδου που εμφανίζει τα περιεχόμενα των διαγνωστικών μηνυμάτων κατά την εκκίνηση μιας παρουσίας διανομής WSL 2.
es_es: Booleano para activar una ventana de consola de salida que muestra el contenido de los mensajes de diagnóstico al iniciar una instancia de distribución de WSL 2.
fi_fi: Totuusarvo, joka ottaa käyttöön tulostekonsolin ikkunan, joka näyttää diagnostiikkaviestien sisällön WSL 2 -distroesiintymän käynnistyksen yhteydessä.
fr_fr: Valeur booléenne permettant d’activer une fenêtre de console de sortie qui affiche le contenu des messages de diagnostic au démarrage d’une instance de distribution WSL 2.
hu_hu: Logikai érték egy kimeneti konzolablak bekapcsolásához, amely megjeleníti a diagnosztikai üzenetek tartalmát egy WSL 2 disztribúciós példány indításakor.
it_it: Valore booleano per attivare una finestra della console di output che mostra il contenuto dei messaggi di diagnostica all'avvio di un'istanza di distribuzione WSL 2.
ja_jp: WSL 2 ディストリビューション インスタンスの開始時に診断メッセージの内容を表示する出力コンソール ウィンドウを有効にするブール値です。
ko_kr: WSL 2 배포판 인스턴스가 시작될 때 진단 메시지의 내용을 표시하는 출력 콘솔 창을 켜는 부울입니다.
nb_no: Boolsk verdi for å aktivere et utdatakonsollvindu som viser innholdet i diagnosemeldinger ved start av en WSL 2-distroforekomst.
nl_nl: Booleaanse waarde voor het inschakelen van een uitvoerconsolevenster waarin de inhoud van di berichten wordt weergegeven bij het begin van een WSL 2-distributie-exemplaar.
pl_pl: Wartość logiczna umożliwiająca włączenie okna konsoli wyjściowej, które wyświetla zawartość komunikatów diagnostycznych po uruchomieniu wystąpienia dystrybucji podsystemu WSL 2.
pt_br: Booleano para ativar uma janela da consola de saída que mostra o conteúdo das mensagens de diagnóstico no início de uma instância de distro WSL 2.
pt_pt: Booleano para ativar uma janela de consola de saída que mostra o conteúdo das mensagens de diagnóstico no início de uma instância da distro WSL 2.
ru_ru: Логическое значение для включения окна вывода консоли, в котором отображается содержимое диагностических сообщений при запуске экземпляра дистрибутива WSL 2.
sv_se: Booleskt värde för att aktivera ett utdatakonsolfönster som visar innehållet i diagnostikmeddelanden när en WSL 2-distributionsinstans startas.
tr_tr: WSL 2 dağıtım örneği başlatıldığında tanılama iletilerinin içeriğini gösteren bir konsol penceresi çıktısını açan Boole değeri.
zh_cn: 用于打开输出控制台窗口的布尔值，该窗口在 WSL 2 发行版实例启动时显示诊断消息的内容。
zh_tw: 布爾值，可開啟輸出控制台視窗，該視窗會在啟動 WSL 2 發行例項時顯示診斷訊息的內容。

# Settings_DefaultVHDSize.Header
source: Default VHD Size
cs_cz: Výchozí velikost virtuálního pevného disku
da_dk: Standardstørrelse for virtuel harddisk
de_de: VHD-Standardgröße
el_gr: Προεπιλεγμένο μέγεθος VHD
es_es: Tamaño de VHD predeterminado
fi_fi: Virtuaalikiintolevyn oletuskoko
fr_fr: Taille par défaut du disque dur virtuel
hu_hu: Alapértelmezett VHD-méret
it_it: Dimensioni predefinite del disco rigido virtuale
ja_jp: 既定の仮想ハード ディスクのサイズ
ko_kr: 기본 VHD 크기
nb_no: Standard VHD-størrelse
nl_nl: Standaardgrootte van VHD
pl_pl: Domyślny rozmiar wirtualnego dysku twardego
pt_br: Tamanho Padrão do VHD
pt_pt: Tamanho de Disco Rígido Virtual Predefinido
ru_ru: Размер виртуального жесткого диска по умолчанию
sv_se: Standardstorlek för virtuell hårddisk
tr_tr: Varsayılan VHD Boyutu
zh_cn: 默认 VHD 大小
zh_tw: 預設 VHD 大小

# Settings_DefaultVHDSize.Description
source: The default max size for the expandable WSL virtual hard disk (VHD) for newly created distributions only.
cs_cz: Výchozí maximální velikost rozšiřitelného virtuálního pevného disku (VHD) WSL pouze pro nově vytvořené distribuce
da_dk: Den maksimale standardstørrelse for den virtuelle WSL-harddisk, der kan udvides, kun for nyoprettede distributioner.
de_de: Die maximale Standardgröße für die erweiterbare virtuelle WSL-Festplatte (VHD) nur für neu erstellte Distributionen.
el_gr: Το προεπιλεγμένο μέγιστο μέγεθος για τον επεκτάσιμο εικονικό σκληρό δίσκο (VHD) του WSL, μόνο για νέες διανομές που δημιουργούνται.
es_es: Tamaño máximo predeterminado para el disco duro virtual (VHD) de WSL ampliable solo para distribuciones recién creadas.
fi_fi: Laajennettavan WSL-virtuaalikiintolevyn (VHD) oletusarvoinen enimmäiskoko vain äskettäin luoduille jakeluille.
fr_fr: Taille maximale par défaut du disque dur virtuel WSL extensible (VHD) pour les distributions nouvellement créées uniquement.
hu_hu: A bővíthető WSL virtuális merevlemez (VHD) alapértelmezett maximális mérete csak az újonnan létrehozott disztribúciókhoz.
it_it: Dimensioni massime predefinite per il disco rigido virtuale WSL espandibile (VHD) solo per le distribuzioni appena create.
ja_jp: 新しく作成されたディストリビューションのみの展開可能な WSL 仮想ハード ディスク (VHD) の既定の最大サイズです。
ko_kr: 새로 만든 배포에 대해서만 확장 가능한 WSL VHD(가상 하드 디스크)의 기본 최대 크기입니다.
nb_no: Standard maksimal størrelse for den utvidbare virtuelle WSL-harddisken (VHD) bare for nyopprettede distribusjoner.
nl_nl: De standaard maximale grootte voor de uitbreidbare virtuele harde WSL-schijf (VHD) alleen voor nieuw gemaakte distributies.
pl_pl: Domyślny maksymalny rozmiar rozszerzalnego wirtualnego dysku twardego (VHD) podsystemu WSL tylko dla nowo utworzonych dystrybucji.
pt_br: O tamanho máximo padrão para o VHD (disco rígido virtual) WSL expansível somente para distribuições recém-criadas.
pt_pt: O tamanho máximo predefinido para o disco rígido virtual WSL expansível (VHD) apenas para distribuições criadas recentemente.
ru_ru: Максимальный размер по умолчанию для расширяемого виртуального жесткого диска WSL (VHD) только для вновь создаваемых дистрибутивов.
sv_se: Standardstorleken för den expanderbara virtuella WSL-hårddisken (VHD) för nyligen skapade distributioner.
tr_tr: Yalnızca yeni oluşturulan dağıtımlar için genişletilebilir WSL sanal sabit diski (VHD) için varsayılan en büyük boyut.
zh_cn: 为可扩展的 WSL 虚拟硬盘指定的默认最大大小 (VHD)，仅用于新创建的分发。
zh_tw: 僅新建立之發佈之可擴充 WSL 虛擬硬碟 (VHD) 的預設大小上限。

# Settings_DefaultVHDSizeResetButton.Content
source: Reset size
cs_cz: Resetovat velikost
da_dk: Nulstil størrelse
de_de: Größe zurücksetzen
el_gr: Επαναφορά μεγέθους
es_es: Restablecer tamaño
fi_fi: Palauta koko
fr_fr: Réinitialiser la taille
hu_hu: Méret visszaállítása
it_it: Reimposta dimensioni
ja_jp: サイズのリセット
ko_kr: 크기 초기화
nb_no: Tilbakestill størrelse
nl_nl: Grootte opnieuw instellen
pl_pl: Resetuj rozmiar
pt_br: Redefinir tamanho
pt_pt: Repor tamanho
ru_ru: Восстановить размер
sv_se: Återställ storlek
tr_tr: Boyutu sıfırla
zh_cn: 重设大小
zh_tw: 重設大小

# Settings_DefaultVHDSizeTextBox.AutomationProperties.Name
source: Default VHD Size
cs_cz: Výchozí velikost virtuálního pevného disku
da_dk: Standardstørrelse for virtuel harddisk
de_de: VHD-Standardgröße
el_gr: Προεπιλεγμένο μέγεθος VHD
es_es: Tamaño de VHD predeterminado
fi_fi: Virtuaalikiintolevyn oletuskoko
fr_fr: Taille par défaut du disque dur virtuel
hu_hu: Alapértelmezett VHD-méret
it_it: Dimensioni predefinite del disco rigido virtuale
ja_jp: 既定の仮想ハード ディスクのサイズ
ko_kr: 기본 VHD 크기
nb_no: Standard VHD-størrelse
nl_nl: Standaardgrootte van VHD
pl_pl: Domyślny rozmiar wirtualnego dysku twardego
pt_br: Tamanho Padrão do VHD
pt_pt: Tamanho de Disco Rígido Virtual Predefinido
ru_ru: Размер виртуального жесткого диска по умолчанию
sv_se: Standardstorlek för virtuell hårddisk
tr_tr: Varsayılan VHD Boyutu
zh_cn: 默认 VHD 大小
zh_tw: 預設 VHD 大小

# Settings_DefaultVHDSizeTextBox.AutomationProperties.HelpText
source: The default max size, specified in megabytes, for the expandable WSL virtual hard disk (VHD) for newly created distributions only.
cs_cz: Výchozí maximální velikost zadaná v megabajtech pro rozšiřitelný virtuální pevný disk WSL (VHD) pouze pro nově vytvořené distribuce.
da_dk: Den maksimale standardstørrelse, angivet i megabyte, for den udvidede virtuelle WSL-harddisk (VHD) for nyoprettede distributioner.
de_de: Die standardmäßige maximale Größe (in MB) für die erweiterbare virtuelle WSL-Festplatte (VHD) nur für neu erstellte Distributionen.
el_gr: Το προεπιλεγμένο μέγιστο μέγεθος, καθορισμένο σε megabytes, για τον επεκτάσιμο εικονικό σκληρό δίσκο (VHD) του WSL, μόνο για νέες διανομές που δημιουργούνται.
es_es: Tamaño máximo predeterminado, especificado en megabytes, para el disco duro virtual (VHD) WSL ampliable solo para distribuciones recién creadas.
fi_fi: Laajennettavan WSL-virtuaalikiintolevyn (VHD) oletusarvoinen enimmäiskoko, megatavuina määritettynä, vain äskettäin luoduille jakeluille.
fr_fr: Taille maximale par défaut, spécifiée en mégaoctets, pour le disque dur virtuel WSL extensible (VHD) pour les distributions nouvellement créées uniquement.
hu_hu: A bővíthető WSL virtuális merevlemez (VHD) alapértelmezett megabájtban mért maximális mérete csak az újonnan létrehozott disztribúciókhoz.
it_it: Dimensioni massime predefinite, specificate in megabyte, per il disco rigido virtuale WSL espandibile (VHD) solo per le distribuzioni appena create.
ja_jp: 新しく作成されたディストリビューションに対してのみ展開可能な WSL 仮想ハード ディスク (VHD) の既定の最大サイズ (MB 単位) です。
ko_kr: 새로 만든 배포에 대해서만 확장 가능한 WSL VHD(가상 하드 디스크)의 기본 최대 크기(MB)입니다.
nb_no: Standard maksimal størrelse, angitt i megabyte, bare for den utvidbare virtuelle WSL-harddisken (VHD) for nylig opprettede distribusjoner.
nl_nl: De standaard maximale grootte, opgegeven in megabytes, voor de uitbreidbare virtuele harde WSL-schijf (VHD) alleen voor nieuw gemaakte distributies.
pl_pl: Domyślny maksymalny rozmiar (w megabajtach) tylko dla rozwijalnego wirtualnego dysku twardego WSL (VHD) dla nowo utworzonych dystrybucji.
pt_br: O tamanho máximo padrão, especificado em megabytes, para o VHD (disco rígido virtual) WSL expansível somente para distribuições recém-criadas.
pt_pt: O tamanho máximo predefinido, especificado em megabytes, para o disco rígido virtual WSL expansível (VHD) apenas para distribuições criadas recentemente.
ru_ru: Максимальный размер по умолчанию, указанный в мегабайтах, для расширяемого виртуального жесткого диска WSL (VHD) только для вновь создаваемых дистрибутивов.
sv_se: Standardstorleken, angiven i megabyte, för den expanderbara virtuella WSL-hårddisken (VHD) endast för nyligen skapade distributioner.
tr_tr: Yalnızca yeni oluşturulan dağıtımlar için genişletilebilir WSL sanal sabit diski (VHD) için megabayt olarak belirtilen varsayılan en büyük boyut.
zh_cn: 为可扩展的 WSL 虚拟硬盘指定的默认最大大小 (VHD)，仅用于新创建的分发。
zh_tw: 只針對新建的發佈指定可擴充 WSL 虛擬硬碟 (VHD) 的預設大小上限，以 MB 為單位。

# Settings_DeveloperPageTitle.Text
source: Developer
cs_cz: Vývojář
da_dk: Softwareudvikler
de_de: Entwickler
el_gr: Προγραμματιστής
es_es: Programador
fi_fi: Kehittäjä
fr_fr: Développeur
hu_hu: Fejlesztő
it_it: Sviluppatore
ja_jp: 開発者
ko_kr: 개발자
nb_no: Utvikler
nl_nl: Ontwikkelaar
pl_pl: Deweloper
pt_br: Desenvolvedor
pt_pt: Programador
ru_ru: Разработчик
sv_se: Utvecklare
tr_tr: Geliştirici
zh_cn: 开发人员
zh_tw: 開發人員

# Settings_DocumentationLink.Content
source: Documentation
cs_cz: Dokumentace
da_dk: Dokumentation
de_de: Dokumentation
el_gr: Τεκμηρίωση
es_es: Documentación
fi_fi: Dokumentaatio
hu_hu: Dokumentáció
it_it: Documentazione
ja_jp: ドキュメント
ko_kr: 설명서
nb_no: Dokumentasjon
nl_nl: Documentatie
pl_pl: Dokumentacja
pt_br: Documentação
pt_pt: Documentação
ru_ru: Документация
sv_se: Dokumentation
tr_tr: Belgeler
zh_cn: 文档
zh_tw: 文件

# Settings_DrvFSMode.Header
source: Change DrvFS mode
cs_cz: Změnit režim DrvFS
da_dk: Skift DrvFS-tilstand
de_de: DrvFS-Modus ändern
el_gr: Αλλαγή λειτουργίας DrvFS
es_es: Cambiar el modo DrvFS
fi_fi: Muuta DrvFS-tilaa
fr_fr: Modifier le mode DrvFS
hu_hu: DrvFS mód módosítása
it_it: Modifica la modalità DrvFS
ja_jp: DrvFS モードの変更
ko_kr: DrvFS 모드 변경
nb_no: Endre DrvFS-modus
nl_nl: DrvFS-modus wijzigen
pl_pl: Zmień tryb DrvFS
pt_br: Alterar o modo DrvFS
pt_pt: Alterar o modo DrvFS
ru_ru: Изменить режим DrvFS
sv_se: Ändra DrvFS-läge
tr_tr: DrvFS modunu değiştir
zh_cn: 更改 DrvFS 模式
zh_tw: 變更 DrvFS 模式

# Settings_DrvFSMode.Description
source: Changes cross-OS file access implementation in WSL.
cs_cz: Změní implementaci přístupu k souborům mezi operačními systémy v WSL.
da_dk: Ændrer implementering af filadgang på tværs af operativsystemer i WSL.
de_de: Ändert die betriebssystemübergreifende Dateizugriffsimplementierung in WSL.
el_gr: Αλλάζει την υλοποίηση πρόσβασης αρχείων μεταξύ διαφορετικών Λειτουργικών Συστημάτων στο WSL.
es_es: Cambia la implementación de acceso a archivos entre sistemas operativos en WSL.
fi_fi: Muuttaa käyttöjärjestelmien välisten tiedostojen käytön toteutusta WSL:ssä.
fr_fr: Modifie l’implémentation de l’accès aux fichiers entre les systèmes d’exploitation dans WSL.
hu_hu: Az operációs rendszerek közötti fájlhozzáférés implementálásának módosítása a WSL-ben.
it_it: Modifica l'implementazione dell'accesso ai file tra sistemi operativi in WSL.
ja_jp: WSL での OS 間のファイル アクセスの実装を変更します。
ko_kr: WSL에서 OS 간 파일 액세스 구현을 변경합니다.
nb_no: Endrer implementering av filtilgang på tvers av operativsystemer i WSL.
nl_nl: Hiermee wijzigt u de implementatie van bestandstoegang tussen besturingssystemen in WSL.
pl_pl: Zmienia implementację dostępu do plików między systemami operacyjnymi w podsystemie WSL.
pt_br: Altera a implementação de acesso a arquivos entre SO no WSL.
pt_pt: Altera a implementação do acesso a ficheiros em todo o SO no WSL.
ru_ru: Изменение реализации доступа к файлам между ОС в WSL.
sv_se: Ändrar implementering av filåtkomst mellan operativsystem i WSL.
tr_tr: WSL'de işletim sistemleri arası dosya erişimi uygulamasını değiştirir.
zh_cn: 更改 WSL 中的跨系统文件访问实现。
zh_tw: 變更 WSL 中的跨作業系統檔案存取實作。

# Settings_DNSProxy.Header
source: DNS Proxy enabled
cs_cz: Proxy server DNS je povolený
da_dk: DNS-proxy er aktiveret
de_de: DNS-Proxy aktiviert
el_gr: Ενεργοποιημένος διακομιστής μεσολάβησης DNS
es_es: Proxy Servicio de nombres de dominio habilitado
fi_fi: DNS-välityspalvelin käytössä
fr_fr: Proxy Domain Name Service (DNS) activé
hu_hu: DNS proxy engedélyezve
it_it: Proxy DNS abilitato
ja_jp: DNS プロキシが有効
ko_kr: DNS 프록시 사용
nb_no: DNS-proxy aktivert
nl_nl: DNS-proxy ingeschakeld
pl_pl: Włączono serwer proxy DNS
pt_br: Proxy DNS habilitado
pt_pt: Proxy DNS ativado
ru_ru: DNS-прокси включен
sv_se: DNS-proxy har aktiverats
tr_tr: DNS Ara Sunucusu etkin
zh_cn: 已启用 DNS 代理
zh_tw: 已啟用 DNS Proxy

# Settings_DNSProxy.Description
source: Only applicable when wsl2.networkingMode is set to NAT. Boolean to inform WSL to configure the DNS Server in Linux to the NAT on the host. Setting to false will mirror DNS servers from Windows to Linux.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.networkingMode nastavena na hodnotu NAT. Logická hodnota pro informování WSL o konfiguraci serveru DNS v Linuxu na překlad adres (NAT) na hostiteli. Nastavení na false bude zrcadlit servery DNS z Windows do Linuxu.
da_dk: Gælder kun, når wsl2.networkingMode er indstillet til NAT. Boolesk for at informere WSL om at konfigurere DNS-serveren i Linux til NAT på værten. Hvis du angiver indstillingen til falsk, spejles DNS-servere fra Windows til Linux.
de_de: Gilt nur, wenn „wsl2.networkingMode“ auf NAT festgelegt ist. Boolescher Wert, um WSL über die Konfiguration des DNS-Servers in Linux für die NAT auf dem Host zu informieren. Die Einstellung „FALSE“ spiegelt DNS-Server von Windows auf Linux.
el_gr: Ισχύει μόνο όταν το wsl2.networkingMode έχει οριστεί σε NAT. Τιμή boolean για να ενημερώσει το WSL να ρυθμίσει τον διακομιστή DNS στο Linux σύμφωνα με το NAT του κεντρικού υπολογιστή. Αν οριστεί σε false, θα αντικατοπτρίζει τους διακομιστές DNS από τα Windows στο Linux.
es_es: Solo es aplicable cuando wsl2.networkingMode se establece en NAT. Booleano para informar a WSL de que debe configurar el servidor DNS en Linux a nat en el host. Si se establece en false, se reflejarán los servidores DNS de Windows a Linux.
fi_fi: Käytettävissä vain, kun wsl2.networkingMode-asetuksena on NAT. Totuusarvo, joka ilmoittaa WSL:lle DNS-palvelimen määrittämisestä Linuxissa NAT-kohteelle isännässä. Jos arvoksi määritetään epätosi, DNS-palvelimet peilataan Windowsista Linuxiin.
fr_fr: Applicable uniquement lorsque wsl2.networkingMode est défini sur NAT. Booléenne pour informer WSL de la configuration du serveur DNS dans Linux sur le NAT sur l’hôte. La valeur définie sur false reflète les serveurs DNS de Windows vers Linux.
hu_hu: Csak akkor alkalmazható, ha a wsl2.networkingMode NAT értékre van beállítva. Logikai érték, amely tájékoztatja a WSL-t, hogy konfigurálja a DNS-kiszolgálót Linux rendszeren a gazdagép NAT-jára. A false értékre állítás a DNS-kiszolgálókat Windowsról Linuxra tükrözi.
it_it: Applicabile solo quando wsl2.networkingMode è impostato su NAT. Valore booleano per informare WSL di configurare il server DNS in Linux nel NAT nell'host. L'impostazione su false eseguirà il mirroring dei server DNS da Windows a Linux.
ja_jp: wsl2.networkingMode が NAT に設定されている場合にのみ適用されます。Linux の DNS サーバーをホスト上の NAT に構成するよう WSL に通知するブール値です。false に設定すると、DNS サーバーが Windows から Linux にミラーされます。
ko_kr: wsl2.networkingMode NAT로 설정된 경우에만 적용할 수 있습니다. WSL에 Linux의 DNS 서버를 호스트의 NAT로 구성하도록 알리는 부울입니다. false로 설정하면 DNS 서버가 Windows에서 Linux로 미러.
nb_no: Gjelder bare når wsl2.networkingMode er satt til NAT. Boolsk for å informere WSL om å konfigurere DNS-serveren i Linux til NAT på verten. Hvis du setter til Usann, speiler dette DNS-servere fra Windows til Linux.
nl_nl: Alleen van toepassing wanneer wsl2.networkingMode is ingesteld op NAT. Booleaanse waarde om WSL te informeren over het configureren van de DNS-server in Linux naar nat op de host. Als u instelt op onwaar, worden DNS-servers gespiegeld van Windows naar Linux.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.networkingMode jest ustawiona na wartość NAT. Wartość logiczna informująca podsystem WSL o skonfigurowaniu serwera DNS w systemie Linux do translatora adresów sieciowych na hoście. Ustawienie wartości false spowoduje zdublowanie serwerów DNS z systemu Windows do systemu Linux.
pt_br: Aplicável somente quando wsl2.networkingMode está definido como NAT. Booliano para informar o WSL para configurar o Servidor DNS no Linux para o NAT no host. A configuração como false espelho dns do Windows para o Linux.
pt_pt: Apenas aplicável quando o wsl2.networkingMode está definido como NAT. Booleano para informar o WSL para configurar o Servidor DNS no Linux para o NAT no anfitrião. Definir como falso irá espelhar os servidores DNS do Windows para Linux.
ru_ru: Применимо, только если для параметра wsl2.networkingMode установлено значение NAT. Логическое значение, сообщающее WSL о необходимости настройки DNS-сервера в Linux для NAT на узле. Установка значения ЛОЖЬ приведет к зеркалированию DNS-серверов из Windows в Linux.
sv_se: Gäller endast när wsl2.networkingMode har angetts till NAT. Booleskt värde för att informera WSL om att konfigurera DNS-servern i Linux till NAT på värden. Om du anger falskt speglas DNS-servrar från Windows till Linux.
tr_tr: Sadece wsl2.networkingMode NAT olarak ayarlandığında uygulanabilir. WSL'ye Linux'taki DNS Sunucusunu ana bilgisayardaki NAT'a göre yapılandırmasını bildiren boole değeri. False olarak ayarlandığında Windows'tan Linux'a DNS sunucuları yansıtılır.
zh_cn: 仅当 wsl2.networkingMode 设置为 NAT 时适用。用于通知 WSL 将 Linux 中的 DNS 服务器配置为主机上的 NAT 的布尔值。设置为 false 将把 Windows 中 DNS 服务器镜像到 Linux。
zh_tw: 只有在 wsl2.networkingMode 設為 NAT 時才適用。布爾值會通知 WSL 將 Linux 中的 DNS 伺服器設定為主機上的 NAT。設定為 false 會將 DNS 伺服器從 Windows 鏡像到 Linux。

# Settings_DNSProxyToggleSwitch.AutomationProperties.Name
source: DNS Proxy enabled.
cs_cz: Proxy server DNS je povolený.
da_dk: DNS-proxy er aktiveret.
de_de: DNS-Proxy aktiviert.
el_gr: Ενεργοποιημένος διακομιστής μεσολάβησης DNS.
es_es: Proxy DNS habilitado.
fi_fi: DNS-välityspalvelin käytössä.
fr_fr: Proxy DNS activé.
hu_hu: DNS proxy engedélyezve.
it_it: Proxy DNS abilitato.
ja_jp: DNS プロキシが有効です。
ko_kr: DNS 프록시를 사용하도록 설정했습니다.
nb_no: DNS-proxy aktivert.
nl_nl: DNS-proxy ingeschakeld.
pl_pl: Włączono serwer proxy DNS.
pt_br: Proxy DNS habilitado.
pt_pt: Proxy DNS ativado.
ru_ru: DNS-прокси включен.
sv_se: DNS-proxy har aktiverats.
tr_tr: DNS Ara Sunucusu etkin.
zh_cn: 已启用 DNS 代理。
zh_tw: 已啟用 DNS Proxy。
